Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedObjectExtensions
The Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedObjectExtensions class provides a set of extension methods to resolve Tekla.Structures.Model.ModelObject data and instances from any tolerated data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedObjectExtensions.GetObjectDescriptor(System.Int32,System.Int32)
Gets a descriptor for the Tekla.Structures.Model.ModelObject identified by identifier and subIdentifier.
identifier: The identifier of the Tekla.Structures.Model.ModelObject to get a descriptor for.
subIdentifier: The secondary identifier of the Tekla.Structures.Model.ModelObject to get a descriptor for.
Returns: A descriptor for the Tekla.Structures.Model.ModelObject identified by identifier and subIdentifier.

Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedObjectExtensions.Resolve(Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace,Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Resolves the Tekla.BIM.Geometry.Face3 referred to by the given Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace.
toleratedFace: The Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace to get the Tekla.BIM.Geometry.Face3 for.
viewData: The view data associated with the toleratedFace.
Returns: The associated Tekla.BIM.Geometry.Face3 instance, if any.

Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedObjectExtensions.Resolve(Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine,Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Resolves the Tekla.Common.Geometry.Segment3 referred to by the given Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine.
toleratedLine: The Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine to get the Tekla.Common.Geometry.Segment3 for.
viewData: The view data associated with the toleratedLine.
Returns: The associated Tekla.Common.Geometry.Segment3 instance, if any.

Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedObjectExtensions.ResolveModelObject(System.Int32)
Resolves the Tekla.Structures.Model.ModelObject referred to by the given Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedObjectDescriptor.
objectIdentifier: The identifier of the Tekla.Structures.Model.ModelObject to get.
Returns: The associated Tekla.Structures.Model.ModelObject as a non-typed System.Object instance.